[
  {
    "city": "Austin",
    "attractions": [
      {
        "name": "Texas State Capitol",
        "num_reviews": "8080",
        "rating": "4.6",
        "ranking_position": "7",
        "neighborhood_info": [
          {
            "location_id": "20932046",
            "name": "Downtown"
          }
        ],
        "description": "If it's in Texas, it must be bigger and better. That is the motto that architects followed with the Capitol Building in Austin. At one time, it was the tallest capitol building in the nation. Others might be taller now, but this is still a beautiful building that shows off many of the natural resources which are so prevalent in Texas, such as limestone and the landscapes.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Lady Bird Lake Hike-and-Bike Trail",
        "num_reviews": "2751",
        "rating": "4.7",
        "ranking_position": "3",
        "neighborhood_info": [
          {
            "location_id": "20929355",
            "name": "South Austin"
          },
          {
            "location_id": "20929358",
            "name": "Zilker Park"
          }
        ],
        "description": "Scenic trail through lush green parks and peaceful lakes: a great place to bike, hike and run.",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          },
          {
            "key": "61",
            "name": "Outdoor Activities"
          }
        ]
      },
      {
        "name": "Barton Springs Pool",
        "num_reviews": "2807",
        "rating": "4.5",
        "ranking_position": "12",
        "neighborhood_info": null,
        "description": "Pull off a cannonball jump at this three-acre swimming pool in Zilker Park. Fed by natural underground springs with an average temperature of 68 degrees Fahrenheit year-round, this limestone pool is a lovely respite from the scorching Texan summers. Switch between tanning on the lawns and swimming in the chilly waters. Plan your visit though as admission is only free in the early morning and late at night. Nominal fees are collected in between. The pool is closed for cleaning on some days, so it’s best to check ahead. Visit on weekdays for fewer crowds. – Tripadvisor",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "Mount Bonnell",
        "num_reviews": "1662",
        "rating": "4.4",
        "ranking_position": "21",
        "neighborhood_info": null,
        "description": "Beautiful park looming almost 800 feet over Austin.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          },
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "LBJ Presidential Library",
        "num_reviews": "3550",
        "rating": "4.7",
        "ranking_position": "2",
        "neighborhood_info": null,
        "description": "The Lyndon Baines Johnson Presidential Library and Museum, also known as the LBJ Presidential Library, is the presidential library and museum of Lyndon Baines Johnson, the 36th President of the United States. It is one of fourteen presidential libraries administered by the National Archives and Records Administration (NARA) and located on the campus of The University of Texas at Austin. We are open daily (except for Thanksgiving, Christmas, and New Year's Day) from 9 AM - 5 PM, with the last admission at 4 PM. Admission prices range from $6 - $16 per person, with free admission given to children 12 and under, active military, student groups, and UT Austin students, faculty, and staff with valid ID. Free parking is available in visitor lot #38. Learn more at lbjlibrary.org.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          },
          {
            "key": "60",
            "name": "Traveler Resources"
          }
        ]
      },
      {
        "name": "Bullock Texas State History Museum",
        "num_reviews": "2802",
        "rating": "4.6",
        "ranking_position": "8",
        "neighborhood_info": [
          {
            "location_id": "20932046",
            "name": "Downtown"
          }
        ],
        "description": "The Bullock Texas State History Museum is the state's official history museum and features three floors of exhibition galleries, IMAX® Theatre, Texas Spirit Theater, The Star Cafe, and Bullock Museum Store.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "The Driskill",
        "num_reviews": "1869",
        "rating": "4.5",
        "ranking_position": "10",
        "neighborhood_info": [
          {
            "location_id": "20932046",
            "name": "Downtown"
          }
        ],
        "description": "Austin's original and iconic hotel features beautiful Romanesque architecture from the late 1800's. With a grand entrance into the opulent lobby, you will be transported to an historic era, with its marble floors, stained-glass dome, and corridors filled with museum-quality artwork. Head up the grand staircase to the most authentic Texas bar in downtown Austin, with daily live music and happy hour.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Congress Avenue Bridge Bat Watching",
        "num_reviews": "4199",
        "rating": "4.2",
        "ranking_position": "29",
        "neighborhood_info": [
          {
            "location_id": "20932046",
            "name": "Downtown"
          }
        ],
        "description": "Experience Austin’s Bats take Flight with Austin Bat Tours! When you book one of our many Austin Bat Tours, you’ll experience the phenomenal experience of watching 1.5 million bats take flight from the most unique and relaxing perspective, the water! Join us as we paddle to the Congress Avenue Bridge and learn about Austin most famous tourist attraction and watch this spectacle of bat flight and many other tours to choose from!",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Lady Bird Johnson Wildflower Center",
        "num_reviews": "1132",
        "rating": "4.4",
        "ranking_position": "15",
        "neighborhood_info": null,
        "description": "The Lady Bird Johnson Wildflower Center in Austin, Texas, is dedicated to inspiring the conservation of native plants. Located a quick but quiet ten miles from downtown, we are a botanical garden open to the public year-round and have become a favored venue for everything from conservation-focused conventions to beautiful weddings. We carry out our mission to inspire the conservation and application of native plants through our gardens, campus, research, education and outreach programs. In doing so, we improve water quality, provide habitat for wildlife and enhance human health and happiness. Visit, learn and make a better world with us. The Wildflower Center was founded by Lady Bird Johnson and Helen Hayes in 1982 and became a part of The University of Texas at Austin in 2006.",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "South Congress Avenue",
        "num_reviews": "1512",
        "rating": "4.4",
        "ranking_position": "14",
        "neighborhood_info": null,
        "description": "Street lined with lots of great restaurants.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      }
    ],
    "hotels": [],
    "flights": []
  },
  {
    "city": "Frisco",
    "attractions": [
      {
        "name": "The Star",
        "num_reviews": "211",
        "rating": "4.4",
        "ranking_position": "4",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Dr Pepper Ballpark",
        "num_reviews": "369",
        "rating": "4.7",
        "ranking_position": "2",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "National Videogame Museum",
        "num_reviews": "172",
        "rating": "4.6",
        "ranking_position": "3",
        "neighborhood_info": null,
        "description": "The National Videogame Museum is the country's first dedicated videogame museum, established to document, preserve and exhibit our industry's rich history. This museum has 20 interactive exhibits on display including an 80s-themed arcade, gaming stations, an 80s room and more.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Toyota Stadium",
        "num_reviews": "200",
        "rating": "4.3",
        "ranking_position": "5",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Frisco Commons Park",
        "num_reviews": "84",
        "rating": "4.7",
        "ranking_position": "6",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "Stonebriar Centre",
        "num_reviews": "98",
        "rating": "4.4",
        "ranking_position": "7",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "26",
            "name": "Shopping"
          }
        ]
      },
      {
        "name": "The Museum of the American Railroad",
        "num_reviews": "78",
        "rating": "3.9",
        "ranking_position": "11",
        "neighborhood_info": null,
        "description": "Climb aboard steam engine trains at this lively museum. Take a first-hand look at luxurious Pullman sleeping cars and Dallas's oldest depot.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "The Ford Center at The Star",
        "num_reviews": "110",
        "rating": "3.0",
        "ranking_position": "28",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Stonebriar Community Church",
        "num_reviews": "72",
        "rating": "4.7",
        "ranking_position": "8",
        "neighborhood_info": null,
        "description": "Stonebriar exists to encourage all people to pursue a lifelong, joyous relationship with Jesus Christ. Our history dates back to 1998, when a small group of people, including Senior Pastor Chuck Swindoll, founded a church in Frisco, Texas. We are a nondenominational, evangelical Christian church. That means that we are governed by our own elders, not an outside organization. About 4,000 people worship at Stonebriar each Sunday.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Frisco Public Library",
        "num_reviews": "47",
        "rating": "4.6",
        "ranking_position": "9",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "60",
            "name": "Traveler Resources"
          }
        ]
      }
    ],
    "hotels": [],
    "flights": []
  },
  {
    "city": "San Antonio",
    "attractions": [
      {
        "name": "San Antonio River Walk",
        "num_reviews": "27130",
        "rating": "4.6",
        "ranking_position": "1",
        "neighborhood_info": [
          {
            "location_id": "21002007",
            "name": "Downtown"
          }
        ],
        "description": "Also known as Paseo del Rio, this 15-mile-long river walk is a must-do in San Antonio. Opt for a self-guided walking or bike tour of the riverside paths, lined with beautiful cypress trees, shops, museums, hotels and of course, Tex-Mex restaurants. But one of the best ways to experience the River Walk is on a hop-on, hop-off cruise, which glides past iconic spots like the Arneson River Theatre, Marriage Island, and the San Antonio Museum of Art. Visit during festivals and holidays like St Patrick's Day and Christmas for exciting river parades and spectacular light illuminations. – Tripadvisor",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Natural Bridge Caverns",
        "num_reviews": "4066",
        "rating": "4.5",
        "ranking_position": "18",
        "neighborhood_info": null,
        "description": "Natural Bridge Caverns is one of Texas’ largest underground attractions that is best explored on a guided tour. The Discovery Tour takes you through the most spectacular part of the caverns 180 feet underground, whilst the Hidden Passages tour shows you a system of huge underground chambers—or experience both on a combo tour. Otherwise, navigate the outdoor Twisted Trails rope course, find your way out of the AMAZEn’ Ranch Roundup maze, and pan for fossils at the Mining Company. Don’t miss the festivities during the holidays, which include the light-ups and a cozy campfire. For additional discounts, book your tickets online in advance. – Tripadvisor",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "The Alamo",
        "num_reviews": "19803",
        "rating": "4.4",
        "ranking_position": "2",
        "neighborhood_info": null,
        "description": "Established in 1718 as Mission San Antonio de Valero, for over 300 years the former mission now known as the Alamo has been a crossroads of history. Having existed under six flags of independent nations and served as a garrison for five different armies, the Alamo has a rich history and a heritage to inspire Texans and people around the world. Although the Alamo is best known as the site of the 1836 Battle of the Alamo, all 300 years of Alamo history are vital to our story. Visitors can take a guided battlefield tour, rent a self-guided audio tour, walk through the historic Alamo Church and Long Barrack Museum, listen to a history talk given by an Alamo Interpreter, participate in living history demonstrations, watch a documentary on the history of the Alamo, and much more. Admission to the Alamo is free, but there is a charge for guided and audio tours.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          },
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Japanese Tea Gardens",
        "num_reviews": "1940",
        "rating": "4.5",
        "ranking_position": "15",
        "neighborhood_info": [
          {
            "location_id": "20484006",
            "name": "Uptown Broadway"
          }
        ],
        "description": "Originally a rock quarry, part of the tea garden came from a donation by George W. Brackenridge and another section from Emma Koehler. In 1915 Ray Lambert, city parks commissioner, thought it would make a nice location for a lily pond. Ultimately, it grew to become a tea garden. The latest renovations began in 2007 and cost about $1.6 million, compared with the $7,000 Lambert originally spent to open the park. It is a Registered Texas Historic Landmark and on the National Register of Historic Places.",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "Mission San Jose",
        "num_reviews": "3505",
        "rating": "4.7",
        "ranking_position": "5",
        "neighborhood_info": [
          {
            "location_id": "21002008",
            "name": "Harlandale"
          }
        ],
        "description": "Founded in 1720, this Spanish frontier mission, the largest of the five San Antonio missions, is best known for its rose window.  On Sundays, this Texas and U.S. National historic site offers a mariachi mass.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "San Antonio Missions National Historical Park",
        "num_reviews": "1957",
        "rating": "4.7",
        "ranking_position": "6",
        "neighborhood_info": null,
        "description": "Historical area that stretches nine miles and contains four important 18th-century missions.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          },
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "San Antonio Botanical Garden",
        "num_reviews": "1167",
        "rating": "4.6",
        "ranking_position": "21",
        "neighborhood_info": [
          {
            "location_id": "20484006",
            "name": "Uptown Broadway"
          }
        ],
        "description": "A wide range of plants from Texas and around the world spread out over 33 acres.",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "San Antonio Zoo",
        "num_reviews": "2064",
        "rating": "4.1",
        "ranking_position": "41",
        "neighborhood_info": [
          {
            "location_id": "20484006",
            "name": "Uptown Broadway"
          }
        ],
        "description": "With more than 8,500 animals on 56 acres, there's plenty of fun for the whole family. The San Antonio Zoo was first established with a donation from George W. Brackenridg in the 1800s. Two of the first cageless exhibits in the U.S. opened here in 1929 and the bird collection is one of the world's largest.",
        "subcategory": [
          {
            "key": "48",
            "name": "Zoos & Aquariums"
          },
          {
            "key": "57",
            "name": "Nature & Parks"
          },
          {
            "key": "61",
            "name": "Outdoor Activities"
          }
        ]
      },
      {
        "name": "Witte Museum",
        "num_reviews": "669",
        "rating": "4.3",
        "ranking_position": "31",
        "neighborhood_info": [
          {
            "location_id": "20484006",
            "name": "Uptown Broadway"
          }
        ],
        "description": "San Antonio's Nature, Science and Culture Museum is an engaging learning experience for all ages featuring everything Texas and so much more! Explore dinosaurs and Texas wildlife. Learn about Texas history through artifacts and art. Experience world-class special exhibitions from across the world. Climb Mt. Witte or ride the Sky Cycle along the banks of the San Antonio River. The Witte Museum is located along the San Antonio River in Brackenridge Park and has an on-site café and gift shop with unique San Antonio keepsakes. Free Parking is located in the Brackenridge Park Garage.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "SeaWorld",
        "num_reviews": "4853",
        "rating": "4.0",
        "ranking_position": "53",
        "neighborhood_info": null,
        "description": "Immerse yourself in the wonders of the sea. Experience up-close animal interactions and dive into the world beneath the waves on thrilling rides, like the Great White coaster. Enjoy awe-inspiring shows like the beautiful and powerful One Ocean(R) featuring Shamu(R), or laugh along at our comical show Pets Ahoy, featuring locally-rescued animals. And don't miss the all-new Discovery Point, where you can experience dolphins through nose-to-bottlenose encounters. Together through inspiration, education and personal animal connections we can make a difference in the natural world we share. Discover your memories that will last a lifetime at SeaWorld(R) San Antonio.",
        "subcategory": [
          {
            "key": "52",
            "name": "Water & Amusement Parks"
          }
        ]
      }
    ],
    "hotels": [],
    "flights": []
  },
  {
    "city": "Dallas",
    "attractions": [
      {
        "name": "The Sixth Floor Museum at Dealey Plaza",
        "num_reviews": "9408",
        "rating": "4.6",
        "ranking_position": "19",
        "neighborhood_info": [
          {
            "location_id": "20483800",
            "name": "Downtown Dallas"
          }
        ],
        "description": "One of Texas’ most visited historic sites, The Sixth Floor Museum at Dealey Plaza chronicles the life, death and legacy of President John F. Kennedy. The Museum is in the former Texas School Book Depository building, where evidence of a sniper was found after the assassination of President Kennedy on November 22, 1963. Much of the exhibit space looks as it appeared in the 1960s. Highlights include a sniper’s perch, the FBI model used by the Warren Commission, an original teletype machine that first transmitted news of the president’s death, Oswald’s wedding ring, historic films, photos and more. An interactive display overlooks Dealey Plaza. Admission includes an audio guide, available in eight languages including ASL. The museum is open daily except Thanksgiving and Christmas. RECOMMENDED: Buy timed-entry tickets in advance at jfk.org. The most convenient paid parking is adjacent to the building; stay in the far right lane of Elm Street to enter the parking lot.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Dallas Arboretum & Botanical Gardens",
        "num_reviews": "5925",
        "rating": "4.7",
        "ranking_position": "4",
        "neighborhood_info": null,
        "description": "A nationally acclaimed 66 acre display garden features breathtaking floral displays all year long. Nestled on the shores of White Rock Lake, the Dallas Arboretum was named \"One of the Most Breathtaking Gardens in the World\" by Architectural Digest. Dallas Blooms festival boasts of over 500,000 spring blooming bulbs, 3,000 azaleas and hundreds of Cherry Blooms-February-April. Summer in the garden includes an outdoor concert series on Thursday evenings and numerous water features with breathtaking floral displays. Autumn at the Arboretum-September-November features a nationally acclaimed Pumpkin Village featuring over 90,000 pumpkins/gourds/squash and named one of America's Best Pumpkin festivals by Fodor's Travel. The 8 acre Rory Meyers Children’s Adventure Garden was designed to connect children with nature. Education is a central focus the gardens mission, which teach life and Earth science with 17 indoor/outdoor galleries and 150 interactive activities - Where science and fun become one. Open seven days a week and Wednesday nights until 8pm from March-October. Seasonal weekday discounts are available. The garden is closed New Year's Day, Thanksgiving and Christmas.",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "Reunion Tower",
        "num_reviews": "4333",
        "rating": "4.4",
        "ranking_position": "20",
        "neighborhood_info": [
          {
            "location_id": "20483800",
            "name": "Downtown Dallas"
          }
        ],
        "description": "Reunion Tower, an iconic Dallas landmark, offers panoramic 360-degree views of the Dallas skyline. Located next to the Hyatt Regency Dallas, the Reunion Tower GeO-Deck offers an indoor/outdoor observation deck. Visit with family, friends, a group or your sweetheart to create unforgettable memories at 470 feet in the air! For information on the restaurant, please visit crownblockdallas.com.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "The George W. Bush Presidential Library and Museum",
        "num_reviews": "3897",
        "rating": "4.6",
        "ranking_position": "8",
        "neighborhood_info": null,
        "description": "Get an in-depth, interactive look at eight years of presidential history at America's 13th presidential library and museum. Explore important issues and events of the administration of President George W. Bush as framed by four themes: freedom, opportunity, compassion and responsibility. NEW FOR 2016: Step into the candidates' shoes in \"PATH TO THE PRESIDENCY,\" a special exhibit on the history of campaigns and elections in the United States. Extend your visit with a stroll through the 15-acre Native Texas Park, enjoy a meal at Café 43, and take home a piece of the presidency from the Museum Store.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Perot Museum of Nature and Science",
        "num_reviews": "3630",
        "rating": "4.5",
        "ranking_position": "13",
        "neighborhood_info": [
          {
            "location_id": "20483801",
            "name": "Oak Lawn"
          }
        ],
        "description": "Everything from dinosaurs to DNA to diamonds are packed into five levels of hands-on discovery and adventure. Prepare to amaze your brain.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Dallas Museum of Art",
        "num_reviews": "2101",
        "rating": "4.5",
        "ranking_position": "10",
        "neighborhood_info": [
          {
            "location_id": "20483800",
            "name": "Downtown Dallas"
          }
        ],
        "description": "Established in 1903, this prestigious art venue features a wide selection of art exhibits, from Ancient Mediterranean to Contemporary Art and Design.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Dallas Cattle Drive Sculptures",
        "num_reviews": "1056",
        "rating": "4.6",
        "ranking_position": "3",
        "neighborhood_info": [
          {
            "location_id": "20483800",
            "name": "Downtown Dallas"
          }
        ],
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Dealey Plaza National Historic Landmark District",
        "num_reviews": "2547",
        "rating": "4.4",
        "ranking_position": "16",
        "neighborhood_info": [
          {
            "location_id": "20483800",
            "name": "Downtown Dallas"
          }
        ],
        "description": "The site includes the former Texas School Book Depository and Dealey Plaza, two of the sights forever associated with the assassination of John F. Kennedy.",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Klyde Warren Park",
        "num_reviews": "2011",
        "rating": "4.5",
        "ranking_position": "6",
        "neighborhood_info": [
          {
            "location_id": "20483801",
            "name": "Oak Lawn"
          },
          {
            "location_id": "20484998",
            "name": "Uptown"
          }
        ],
        "description": "",
        "subcategory": [
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "The Dallas World Aquarium",
        "num_reviews": "4871",
        "rating": "4.3",
        "ranking_position": "26",
        "neighborhood_info": [
          {
            "location_id": "20483800",
            "name": "Downtown Dallas"
          }
        ],
        "description": "The adventure at The Dallas World Aquarium begins at the top of the rainforest exhibit, where exotic birds, such as Cocks-of-the-rock and many species of toucans, can be seen. Lounging around are Two-toed and Three-toed sloths. Endangered animals, such as Orinoco crocodiles, Giant river otters, Antillean manatees and several species of monkeys are part of the many conservation projects. The aquarium portion displays interesting marine life, including Japanese crabs, jellyfish, Leafy, Weedy and Ribbon seadragons. Black-footed and Blue penguins can be seen swimming as guests enjoy the outdoor South Africa exhibit. Sharks, rays and sawfish are only a few of the fish living in the Mundo Maya cenote. Safe from Neotropical eagles, are euphonias, tanagers and hummingbirds. Reptiles and amphibians, both of significance to the Maya culture, can be seen throughout the exhibit.",
        "subcategory": [
          {
            "key": "48",
            "name": "Zoos & Aquariums"
          },
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      }
    ],
    "hotels": [],
    "flights": []
  },
  {
    "city": "Houston",
    "attractions": [
      {
        "name": "The Houston Museum of Natural Science",
        "num_reviews": "5359",
        "rating": "4.6",
        "ranking_position": "15",
        "neighborhood_info": [
          {
            "location_id": "20483836",
            "name": "The Museum District"
          }
        ],
        "description": "This outstanding science museum has a spectacular collection of mineral specimens, a dinosaur skeleton, space-station models, a planetarium, IMAX theater and a six-story butterfly center in which these beautiful creatures land delicately on outstretched arms.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Daikin Park",
        "num_reviews": "3232",
        "rating": "4.5",
        "ranking_position": "17",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Museum of Fine Arts, Houston",
        "num_reviews": "2780",
        "rating": "4.6",
        "ranking_position": "5",
        "neighborhood_info": [
          {
            "location_id": "20483836",
            "name": "The Museum District"
          }
        ],
        "description": "The Museum of Fine Arts, Houston, is the largest cultural institution in the southwest region of the United States. The Museum’s encyclopedic collections of nearly 70,000 objects cover world cultures dating from antiquity to the present and include in-depth holdings of American art, European paintings, Pre-Columbian and African gold, decorative arts and design, photography, prints and drawings, 20th- and 21st-century painting and sculpture, and Latin American art.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Children's Museum Houston",
        "num_reviews": "1681",
        "rating": "4.6",
        "ranking_position": "10",
        "neighborhood_info": [
          {
            "location_id": "20483836",
            "name": "The Museum District"
          }
        ],
        "description": "Hands-on interactive exhibits in the areas of science and technology, history and culture, health and human development, and the arts.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "Houston Zoo",
        "num_reviews": "4266",
        "rating": "4.5",
        "ranking_position": "20",
        "neighborhood_info": [
          {
            "location_id": "20483835",
            "name": "Medical Center"
          }
        ],
        "description": "The Houston Zoo provides a fun, unique, and inspirational experience fostering appreciation, knowledge, and care for the natural world. Essentially a small city encompassing a world of ecosystems and experiences, the Houston Zoo is made up of many moving parts. We have over 6000 permanent residents (our animals) for whom we provide housing, meals, medical care and, yes, even education! In addition, we have over 1.84 million guests each year who come to experience our incredible variety of animals and ecosystems, as well as attend special private and public events and entertainment. Our dedicated staff works around the clock to ensure that the Zoo is always running smoothly for the safety and well being of our residents and guests.",
        "subcategory": [
          {
            "key": "48",
            "name": "Zoos & Aquariums"
          },
          {
            "key": "57",
            "name": "Nature & Parks"
          },
          {
            "key": "61",
            "name": "Outdoor Activities"
          }
        ]
      },
      {
        "name": "Space Center Houston",
        "num_reviews": "10025",
        "rating": "4.3",
        "ranking_position": "31",
        "neighborhood_info": null,
        "description": "Located in the heart of NASA’s spaceflight program, Space Center Houston is a must-visit for fans of space exploration. With more than 400 space-related artefacts and numerous interactive exhibitions, you can easily spend a whole day learning about NASA’s history and current work. Be sure to hop on the tram tour too, which takes you around the real site of the Johnson Space Center, including the original Mission Control room and a behind-the-scenes look at the astronaut training facilities. You might want to join VIP tours by NASA experts to gain a deeper understanding and inside knowledge of the center. – Tripadvisor",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          }
        ]
      },
      {
        "name": "The Galleria",
        "num_reviews": "5272",
        "rating": "4.3",
        "ranking_position": "29",
        "neighborhood_info": [
          {
            "location_id": "20483833",
            "name": "Great Uptown"
          }
        ],
        "description": "More than 26 million visitors each year seek the dynamic & fine shopping environment uniquely offered by The Galleria, Texas’ largest shopping center and fourth largest domain nationally. International guests and Houstonians blend seamlessly in the center while on shopping excursions or entertaining guests at one of the signature eateries. Spanning 2.4 million square feet of space, housing 400 fine stores and restaurants, two high-rise hotels, and three office towers, The Galleria is Houston’s most popular retail and tourist destination, meeting every style and taste.",
        "subcategory": [
          {
            "key": "26",
            "name": "Shopping"
          }
        ]
      },
      {
        "name": "Cockrell Butterfly Center",
        "num_reviews": "722",
        "rating": "4.7",
        "ranking_position": "6",
        "neighborhood_info": [
          {
            "location_id": "20483836",
            "name": "The Museum District"
          }
        ],
        "description": "Next to the Houston Museum of Natural Science, the glass-enclosed butterfly habitat includes a simulated rainforest and thousands of colorful butterflies. A dramatic 50-foot waterfall and exotic plants transport visitors.",
        "subcategory": [
          {
            "key": "49",
            "name": "Museums"
          },
          {
            "key": "57",
            "name": "Nature & Parks"
          }
        ]
      },
      {
        "name": "Toyota Center",
        "num_reviews": "918",
        "rating": "4.3",
        "ranking_position": "21",
        "neighborhood_info": [
          {
            "location_id": "20933702",
            "name": "Downtown"
          }
        ],
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      },
      {
        "name": "Rodeo Houston or Houston Livestock Show and Rodeo",
        "num_reviews": "616",
        "rating": "4.6",
        "ranking_position": "7",
        "neighborhood_info": null,
        "description": "",
        "subcategory": [
          {
            "key": "47",
            "name": "Sights & Landmarks"
          }
        ]
      }
    ],
    "hotels": [],
    "flights": []
  }
]